; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l7-t1-p11---int100n150-m25---int100c110---s283---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 l6 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 - fuellevel
)

(:init
(sum level0 level5 level5)
(sum level0 level6 level6)
(sum level0 level8 level8)
(sum level0 level10 level10)
(sum level0 level17 level17)
(sum level0 level22 level22)
(sum level1 level5 level6)
(sum level1 level6 level7)
(sum level1 level8 level9)
(sum level1 level10 level11)
(sum level1 level17 level18)
(sum level1 level22 level23)
(sum level2 level5 level7)
(sum level2 level6 level8)
(sum level2 level8 level10)
(sum level2 level10 level12)
(sum level2 level17 level19)
(sum level2 level22 level24)
(sum level3 level5 level8)
(sum level3 level6 level9)
(sum level3 level8 level11)
(sum level3 level10 level13)
(sum level3 level17 level20)
(sum level3 level22 level25)
(sum level4 level5 level9)
(sum level4 level6 level10)
(sum level4 level8 level12)
(sum level4 level10 level14)
(sum level4 level17 level21)
(sum level4 level22 level26)
(sum level5 level5 level10)
(sum level5 level6 level11)
(sum level5 level8 level13)
(sum level5 level10 level15)
(sum level5 level17 level22)
(sum level5 level22 level27)
(sum level6 level5 level11)
(sum level6 level6 level12)
(sum level6 level8 level14)
(sum level6 level10 level16)
(sum level6 level17 level23)
(sum level6 level22 level28)
(sum level7 level5 level12)
(sum level7 level6 level13)
(sum level7 level8 level15)
(sum level7 level10 level17)
(sum level7 level17 level24)
(sum level7 level22 level29)
(sum level8 level5 level13)
(sum level8 level6 level14)
(sum level8 level8 level16)
(sum level8 level10 level18)
(sum level8 level17 level25)
(sum level8 level22 level30)
(sum level9 level5 level14)
(sum level9 level6 level15)
(sum level9 level8 level17)
(sum level9 level10 level19)
(sum level9 level17 level26)
(sum level9 level22 level31)
(sum level10 level5 level15)
(sum level10 level6 level16)
(sum level10 level8 level18)
(sum level10 level10 level20)
(sum level10 level17 level27)
(sum level10 level22 level32)
(sum level11 level5 level16)
(sum level11 level6 level17)
(sum level11 level8 level19)
(sum level11 level10 level21)
(sum level11 level17 level28)
(sum level11 level22 level33)
(sum level12 level5 level17)
(sum level12 level6 level18)
(sum level12 level8 level20)
(sum level12 level10 level22)
(sum level12 level17 level29)
(sum level12 level22 level34)
(sum level13 level5 level18)
(sum level13 level6 level19)
(sum level13 level8 level21)
(sum level13 level10 level23)
(sum level13 level17 level30)
(sum level13 level22 level35)
(sum level14 level5 level19)
(sum level14 level6 level20)
(sum level14 level8 level22)
(sum level14 level10 level24)
(sum level14 level17 level31)
(sum level14 level22 level36)
(sum level15 level5 level20)
(sum level15 level6 level21)
(sum level15 level8 level23)
(sum level15 level10 level25)
(sum level15 level17 level32)
(sum level15 level22 level37)
(sum level16 level5 level21)
(sum level16 level6 level22)
(sum level16 level8 level24)
(sum level16 level10 level26)
(sum level16 level17 level33)
(sum level16 level22 level38)
(sum level17 level5 level22)
(sum level17 level6 level23)
(sum level17 level8 level25)
(sum level17 level10 level27)
(sum level17 level17 level34)
(sum level17 level22 level39)
(sum level18 level5 level23)
(sum level18 level6 level24)
(sum level18 level8 level26)
(sum level18 level10 level28)
(sum level18 level17 level35)
(sum level18 level22 level40)
(sum level19 level5 level24)
(sum level19 level6 level25)
(sum level19 level8 level27)
(sum level19 level10 level29)
(sum level19 level17 level36)
(sum level19 level22 level41)
(sum level20 level5 level25)
(sum level20 level6 level26)
(sum level20 level8 level28)
(sum level20 level10 level30)
(sum level20 level17 level37)
(sum level20 level22 level42)
(sum level21 level5 level26)
(sum level21 level6 level27)
(sum level21 level8 level29)
(sum level21 level10 level31)
(sum level21 level17 level38)
(sum level21 level22 level43)
(sum level22 level5 level27)
(sum level22 level6 level28)
(sum level22 level8 level30)
(sum level22 level10 level32)
(sum level22 level17 level39)
(sum level22 level22 level44)
(sum level23 level5 level28)
(sum level23 level6 level29)
(sum level23 level8 level31)
(sum level23 level10 level33)
(sum level23 level17 level40)
(sum level23 level22 level45)
(sum level24 level5 level29)
(sum level24 level6 level30)
(sum level24 level8 level32)
(sum level24 level10 level34)
(sum level24 level17 level41)
(sum level24 level22 level46)
(sum level25 level5 level30)
(sum level25 level6 level31)
(sum level25 level8 level33)
(sum level25 level10 level35)
(sum level25 level17 level42)
(sum level25 level22 level47)
(sum level26 level5 level31)
(sum level26 level6 level32)
(sum level26 level8 level34)
(sum level26 level10 level36)
(sum level26 level17 level43)
(sum level26 level22 level48)
(sum level27 level5 level32)
(sum level27 level6 level33)
(sum level27 level8 level35)
(sum level27 level10 level37)
(sum level27 level17 level44)
(sum level27 level22 level49)
(sum level28 level5 level33)
(sum level28 level6 level34)
(sum level28 level8 level36)
(sum level28 level10 level38)
(sum level28 level17 level45)
(sum level28 level22 level50)
(sum level29 level5 level34)
(sum level29 level6 level35)
(sum level29 level8 level37)
(sum level29 level10 level39)
(sum level29 level17 level46)
(sum level29 level22 level51)
(sum level30 level5 level35)
(sum level30 level6 level36)
(sum level30 level8 level38)
(sum level30 level10 level40)
(sum level30 level17 level47)
(sum level30 level22 level52)
(sum level31 level5 level36)
(sum level31 level6 level37)
(sum level31 level8 level39)
(sum level31 level10 level41)
(sum level31 level17 level48)
(sum level31 level22 level53)
(sum level32 level5 level37)
(sum level32 level6 level38)
(sum level32 level8 level40)
(sum level32 level10 level42)
(sum level32 level17 level49)
(sum level32 level22 level54)
(sum level33 level5 level38)
(sum level33 level6 level39)
(sum level33 level8 level41)
(sum level33 level10 level43)
(sum level33 level17 level50)
(sum level33 level22 level55)
(sum level34 level5 level39)
(sum level34 level6 level40)
(sum level34 level8 level42)
(sum level34 level10 level44)
(sum level34 level17 level51)
(sum level34 level22 level56)
(sum level35 level5 level40)
(sum level35 level6 level41)
(sum level35 level8 level43)
(sum level35 level10 level45)
(sum level35 level17 level52)
(sum level35 level22 level57)
(sum level36 level5 level41)
(sum level36 level6 level42)
(sum level36 level8 level44)
(sum level36 level10 level46)
(sum level36 level17 level53)
(sum level36 level22 level58)
(sum level37 level5 level42)
(sum level37 level6 level43)
(sum level37 level8 level45)
(sum level37 level10 level47)
(sum level37 level17 level54)
(sum level37 level22 level59)
(sum level38 level5 level43)
(sum level38 level6 level44)
(sum level38 level8 level46)
(sum level38 level10 level48)
(sum level38 level17 level55)
(sum level38 level22 level60)
(sum level39 level5 level44)
(sum level39 level6 level45)
(sum level39 level8 level47)
(sum level39 level10 level49)
(sum level39 level17 level56)
(sum level39 level22 level61)
(sum level40 level5 level45)
(sum level40 level6 level46)
(sum level40 level8 level48)
(sum level40 level10 level50)
(sum level40 level17 level57)
(sum level40 level22 level62)
(sum level41 level5 level46)
(sum level41 level6 level47)
(sum level41 level8 level49)
(sum level41 level10 level51)
(sum level41 level17 level58)
(sum level41 level22 level63)
(sum level42 level5 level47)
(sum level42 level6 level48)
(sum level42 level8 level50)
(sum level42 level10 level52)
(sum level42 level17 level59)
(sum level42 level22 level64)
(sum level43 level5 level48)
(sum level43 level6 level49)
(sum level43 level8 level51)
(sum level43 level10 level53)
(sum level43 level17 level60)
(sum level43 level22 level65)
(sum level44 level5 level49)
(sum level44 level6 level50)
(sum level44 level8 level52)
(sum level44 level10 level54)
(sum level44 level17 level61)
(sum level44 level22 level66)
(sum level45 level5 level50)
(sum level45 level6 level51)
(sum level45 level8 level53)
(sum level45 level10 level55)
(sum level45 level17 level62)
(sum level45 level22 level67)
(sum level46 level5 level51)
(sum level46 level6 level52)
(sum level46 level8 level54)
(sum level46 level10 level56)
(sum level46 level17 level63)
(sum level46 level22 level68)
(sum level47 level5 level52)
(sum level47 level6 level53)
(sum level47 level8 level55)
(sum level47 level10 level57)
(sum level47 level17 level64)
(sum level47 level22 level69)
(sum level48 level5 level53)
(sum level48 level6 level54)
(sum level48 level8 level56)
(sum level48 level10 level58)
(sum level48 level17 level65)
(sum level48 level22 level70)
(sum level49 level5 level54)
(sum level49 level6 level55)
(sum level49 level8 level57)
(sum level49 level10 level59)
(sum level49 level17 level66)
(sum level49 level22 level71)
(sum level50 level5 level55)
(sum level50 level6 level56)
(sum level50 level8 level58)
(sum level50 level10 level60)
(sum level50 level17 level67)
(sum level50 level22 level72)
(sum level51 level5 level56)
(sum level51 level6 level57)
(sum level51 level8 level59)
(sum level51 level10 level61)
(sum level51 level17 level68)
(sum level51 level22 level73)
(sum level52 level5 level57)
(sum level52 level6 level58)
(sum level52 level8 level60)
(sum level52 level10 level62)
(sum level52 level17 level69)
(sum level52 level22 level74)
(sum level53 level5 level58)
(sum level53 level6 level59)
(sum level53 level8 level61)
(sum level53 level10 level63)
(sum level53 level17 level70)
(sum level53 level22 level75)
(sum level54 level5 level59)
(sum level54 level6 level60)
(sum level54 level8 level62)
(sum level54 level10 level64)
(sum level54 level17 level71)
(sum level54 level22 level76)
(sum level55 level5 level60)
(sum level55 level6 level61)
(sum level55 level8 level63)
(sum level55 level10 level65)
(sum level55 level17 level72)
(sum level55 level22 level77)
(sum level56 level5 level61)
(sum level56 level6 level62)
(sum level56 level8 level64)
(sum level56 level10 level66)
(sum level56 level17 level73)
(sum level56 level22 level78)
(sum level57 level5 level62)
(sum level57 level6 level63)
(sum level57 level8 level65)
(sum level57 level10 level67)
(sum level57 level17 level74)
(sum level57 level22 level79)
(sum level58 level5 level63)
(sum level58 level6 level64)
(sum level58 level8 level66)
(sum level58 level10 level68)
(sum level58 level17 level75)
(sum level58 level22 level80)
(sum level59 level5 level64)
(sum level59 level6 level65)
(sum level59 level8 level67)
(sum level59 level10 level69)
(sum level59 level17 level76)
(sum level59 level22 level81)
(sum level60 level5 level65)
(sum level60 level6 level66)
(sum level60 level8 level68)
(sum level60 level10 level70)
(sum level60 level17 level77)
(sum level61 level5 level66)
(sum level61 level6 level67)
(sum level61 level8 level69)
(sum level61 level10 level71)
(sum level61 level17 level78)
(sum level62 level5 level67)
(sum level62 level6 level68)
(sum level62 level8 level70)
(sum level62 level10 level72)
(sum level62 level17 level79)
(sum level63 level5 level68)
(sum level63 level6 level69)
(sum level63 level8 level71)
(sum level63 level10 level73)
(sum level63 level17 level80)
(sum level64 level5 level69)
(sum level64 level6 level70)
(sum level64 level8 level72)
(sum level64 level10 level74)
(sum level64 level17 level81)
(sum level65 level5 level70)
(sum level65 level6 level71)
(sum level65 level8 level73)
(sum level65 level10 level75)
(sum level66 level5 level71)
(sum level66 level6 level72)
(sum level66 level8 level74)
(sum level66 level10 level76)
(sum level67 level5 level72)
(sum level67 level6 level73)
(sum level67 level8 level75)
(sum level67 level10 level77)
(sum level68 level5 level73)
(sum level68 level6 level74)
(sum level68 level8 level76)
(sum level68 level10 level78)
(sum level69 level5 level74)
(sum level69 level6 level75)
(sum level69 level8 level77)
(sum level69 level10 level79)
(sum level70 level5 level75)
(sum level70 level6 level76)
(sum level70 level8 level78)
(sum level70 level10 level80)
(sum level71 level5 level76)
(sum level71 level6 level77)
(sum level71 level8 level79)
(sum level71 level10 level81)
(sum level72 level5 level77)
(sum level72 level6 level78)
(sum level72 level8 level80)
(sum level73 level5 level78)
(sum level73 level6 level79)
(sum level73 level8 level81)
(sum level74 level5 level79)
(sum level74 level6 level80)
(sum level75 level5 level80)
(sum level75 level6 level81)
(sum level76 level5 level81)

(connected l0 l2)
(fuelcost level6 l0 l2)
(connected l0 l3)
(fuelcost level17 l0 l3)
(connected l0 l5)
(fuelcost level6 l0 l5)
(connected l1 l5)
(fuelcost level5 l1 l5)
(connected l2 l0)
(fuelcost level6 l2 l0)
(connected l2 l3)
(fuelcost level6 l2 l3)
(connected l2 l4)
(fuelcost level8 l2 l4)
(connected l2 l5)
(fuelcost level22 l2 l5)
(connected l3 l0)
(fuelcost level17 l3 l0)
(connected l3 l2)
(fuelcost level6 l3 l2)
(connected l3 l4)
(fuelcost level17 l3 l4)
(connected l3 l6)
(fuelcost level10 l3 l6)
(connected l4 l2)
(fuelcost level8 l4 l2)
(connected l4 l3)
(fuelcost level17 l4 l3)
(connected l5 l0)
(fuelcost level6 l5 l0)
(connected l5 l1)
(fuelcost level5 l5 l1)
(connected l5 l2)
(fuelcost level22 l5 l2)
(connected l5 l6)
(fuelcost level8 l5 l6)
(connected l6 l3)
(fuelcost level10 l6 l3)
(connected l6 l5)
(fuelcost level8 l6 l5)

(at t0 l0)
(fuel t0 level81)
(= (total-cost) 0)

(at p0 l5)
(at p1 l6)
(at p2 l3)
(at p3 l0)
(at p4 l3)
(at p5 l1)
(at p6 l6)
(at p7 l1)
(at p8 l1)
(at p9 l4)
(at p10 l4)
)

(:goal
(and
(at p0 l3)
(at p1 l0)
(at p2 l6)
(at p3 l3)
(at p4 l5)
(at p5 l0)
(at p6 l0)
(at p7 l4)
(at p8 l4)
(at p9 l2)
(at p10 l5)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p3 t0 l0)
   deleted: (at p3 l0)
   added: (in p3 t0)
   goals met: 0 of 11
2. (drive t0 l0 l5 level75 level6 level81)
   deleted: (at t0 l0) (fuel t0 level81)
   added: (at t0 l5) (fuel t0 level75)
   goals met: 0 of 11
3. (load p0 t0 l5)
   deleted: (at p0 l5)
   added: (in p0 t0)
   goals met: 0 of 11
4. (drive t0 l5 l1 level70 level5 level75)
   deleted: (at t0 l5) (fuel t0 level75)
   added: (at t0 l1) (fuel t0 level70)
   goals met: 0 of 11
5. (load p8 t0 l1)
   deleted: (at p8 l1)
   added: (in p8 t0)
   goals met: 0 of 11
6. (load p7 t0 l1)
   deleted: (at p7 l1)
   added: (in p7 t0)
   goals met: 0 of 11
7. (load p5 t0 l1)
   deleted: (at p5 l1)
   added: (in p5 t0)
   goals met: 0 of 11
8. (drive t0 l1 l5 level65 level5 level70)
   deleted: (at t0 l1) (fuel t0 level70)
   added: (at t0 l5) (fuel t0 level65)
   goals met: 0 of 11
9. (drive t0 l5 l6 level57 level8 level65)
   deleted: (at t0 l5) (fuel t0 level65)
   added: (at t0 l6) (fuel t0 level57)
   goals met: 0 of 11
10. (load p6 t0 l6)
   deleted: (at p6 l6)
   added: (in p6 t0)
   goals met: 0 of 11
11. (load p1 t0 l6)
   deleted: (at p1 l6)
   added: (in p1 t0)
   goals met: 0 of 11
12. (drive t0 l6 l3 level47 level10 level57)
   deleted: (at t0 l6) (fuel t0 level57)
   added: (at t0 l3) (fuel t0 level47)
   goals met: 0 of 11
13. (unload p3 t0 l3)
   deleted: (in p3 t0)
   added: (at p3 l3)
   goals met: 1 of 11
14. (unload p0 t0 l3)
   deleted: (in p0 t0)
   added: (at p0 l3)
   goals met: 2 of 11
15. (load p4 t0 l3)
   deleted: (at p4 l3)
   added: (in p4 t0)
   goals met: 2 of 11
16. (load p2 t0 l3)
   deleted: (at p2 l3)
   added: (in p2 t0)
   goals met: 2 of 11
17. (drive t0 l3 l4 level30 level17 level47)
   deleted: (at t0 l3) (fuel t0 level47)
   added: (at t0 l4) (fuel t0 level30)
   goals met: 2 of 11
18. (load p10 t0 l4)
   deleted: (at p10 l4)
   added: (in p10 t0)
   goals met: 2 of 11
19. (load p9 t0 l4)
   deleted: (at p9 l4)
   added: (in p9 t0)
   goals met: 2 of 11
20. (unload p7 t0 l4)
   deleted: (in p7 t0)
   added: (at p7 l4)
   goals met: 3 of 11
21. (unload p8 t0 l4)
   deleted: (in p8 t0)
   added: (at p8 l4)
   goals met: 4 of 11
22. (drive t0 l4 l2 level22 level8 level30)
   deleted: (at t0 l4) (fuel t0 level30)
   added: (at t0 l2) (fuel t0 level22)
   goals met: 4 of 11
23. (unload p9 t0 l2)
   deleted: (in p9 t0)
   added: (at p9 l2)
   goals met: 5 of 11
24. (drive t0 l2 l0 level16 level6 level22)
   deleted: (at t0 l2) (fuel t0 level22)
   added: (at t0 l0) (fuel t0 level16)
   goals met: 5 of 11
25. (unload p1 t0 l0)
   deleted: (in p1 t0)
   added: (at p1 l0)
   goals met: 6 of 11
26. (unload p5 t0 l0)
   deleted: (in p5 t0)
   added: (at p5 l0)
   goals met: 7 of 11
27. (unload p6 t0 l0)
   deleted: (in p6 t0)
   added: (at p6 l0)
   goals met: 8 of 11
28. (drive t0 l0 l5 level10 level6 level16)
   deleted: (at t0 l0) (fuel t0 level16)
   added: (at t0 l5) (fuel t0 level10)
   goals met: 8 of 11
29. (unload p10 t0 l5)
   deleted: (in p10 t0)
   added: (at p10 l5)
   goals met: 9 of 11
30. (unload p4 t0 l5)
   deleted: (in p4 t0)
   added: (at p4 l5)
   goals met: 10 of 11
31. (drive t0 l5 l6 level2 level8 level10)
   deleted: (at t0 l5) (fuel t0 level10)
   added: (at t0 l6) (fuel t0 level2)
   goals met: 10 of 11
32. (unload p2 t0 l6)
   deleted: (in p2 t0)
   added: (at p2 l6)
   goals met: 11 of 11
